from ToppingIssue import app
from flask import render_template
import json

@app.route('/')
def index():
    return render_template("index.html")

@app.route('/categoryData')
def categoryData():
    data = json.dumps({'정치': [['청와대', 101], ['국회/정당', 102], ['북한', 103], ['행정', 104], ['국방/외교', 105], ['정치 일반', 106]],
    '경제': [['금융', 201], ['증권', 202], ['산업/재계', 203], ['중기/벤처', 204], ['부동산', 205], ['글로벌 경제', 206], ['생활경제', 207], ['경제 일반', 208]],
    '사회' : [['사건사고', 301], ['교육', 302], ['노동', 303], ['언론', 304], ['환경', 305], ['인권/복지', 306], ['식품/의료', 307], ['지역', 308]],
    '세계' : [['아시아/호주', 401], ['미국/중남미', 402], ['유럽', 403], ['중동/아프리카', 404], ['세계 일반', 405]],
    'IT/과학' : [['모바일', 501], ['인터넷/SNS', 502], ['통신/뉴미디어', 503], ['IT 일반', 504], ['보안/해킹', 505], ['컴퓨터', 506], ['게임/리뷰', 507], ['과학 일반', 508]] })
    return data